app/controllers/admins_controller.rb

INSERT INTO "blogs" ("title", "account_id", "blog_content_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "测试一下呗测试一下呗测试一下呗"], ["account_id", 1], ["blog_content_id", 3], ["created_at", "2016-04-23 13:16:59.636316"], ["updated_at", "2016-04-23 13:16:59.636316"]]
---
	def blog
		@blog = Blog.new(blog_params)
		@blog.account = current_account
		if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 17]]
SELECT "attachments".* FROM "attachments" WHERE "attachments"."account_id" = ? AND ("attachments"."blog_id" = 17 OR "attachments"."blog_id" IS NULL)  ORDER BY id ASC  [["account_id", 1]]
---
	def edit_blog
		@blog = Blog.find(params[:id].to_i)
		@attachments = current_account.attachments.where(:blog_id => [nil, @blog.id]).order('id ASC')

SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", 39]]
---
  	def attachment
  		@attachment = Attachment.find(params[:id])

INSERT INTO "attachments" ("file", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["file", "msl12"], ["account_id", 1], ["created_at", "2016-05-02 11:47:39.655140"], ["updated_at", "2016-05-02 11:47:39.655140"]]
---
  	def create_attachment
  		attachment = Attachment.new(attachment_params)
  		attachment.account = current_account
  		if attachment.save

SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", 37]]
DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 37]]
---
  	def delete_attachment
  		@attachment = Attachment.find(params[:id])
  		@attachment.destroy