app/controllers/blog_controller.rb

SELECT  "blogs".* FROM "blogs"  ORDER BY id DESC LIMIT 3 OFFSET 0
---
	def index
		  @blogs = Blog.order('id DESC').paginate(page: params[:page])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 17]]
UPDATE "blogs" SET "view_count" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["view_count", 332], ["updated_at", "2016-05-02 11:37:41.599985"], ["id", 17]]
---
	def show
		@blog = Blog.find(params[:id].to_i)
		@blog.increment_view_count

SELECT  "blogs".* FROM "blogs" JOIN taggings blogs_taggings_3de4f90  ON blogs_taggings_3de4f90.taggable_id = blogs.id AND blogs_taggings_3de4f90.taggable_type = 'Blog' AND blogs_taggings_3de4f90.tag_id = 7  ORDER BY id DESC LIMIT 3 OFFSET 0
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN blogs ON blogs.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Blog' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT blogs.id FROM "blogs")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
SELECT  "blogs".* FROM "blogs"  ORDER BY view_count DESC LIMIT 5
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('chuangmeng'))
---
	def tag
		@blogs = Blog.tagged_with(params[:name]).order('id DESC').paginate(page: params[:page])
		if @blogs.blank?

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 17]]
INSERT INTO "blog_comments" ("blog_id", "account_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["blog_id", 17], ["account_id", 1], ["content", "让我试一下！"], ["created_at", "2016-05-03 09:34:33.984402"], ["updated_at", "2016-05-03 09:34:33.984402"]]
---
	def create_comment
		return false unless account_login?
		blog = Blog.find(params[:id])
		@comment = blog.comments.new
		@comment.account = current_account
		@comment.content = blog_comment_params[:content]
		@comment.save

SELECT  "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."id" = ? LIMIT 1  [["id", 122]]
DELETE FROM "blog_comments" WHERE "blog_comments"."id" = ?  [["id", 122]]
---
	def comment
		@comment = BlogComment.find(params[:id])
		if account_admin?
			@comment.destroy