app/controllers/home_controller.rb

SELECT  "blogs".* FROM "blogs"  ORDER BY id DESC LIMIT 3 OFFSET 0
---
	def index
		@blogs = Blog.order('id DESC').paginate(page: params[:page])