app/views/blog/_blog.html.erb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('chuangmeng'))
---
    <div class="infor_tag">
      <% blog.cached_tags.each do |tag| %>