app/views/blog/_comment.html.erb

INSERT INTO "blog_comments" ("blog_id", "account_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["blog_id", 17], ["account_id", 1], ["content", "让我试一下！"], ["created_at", "2016-05-03 09:34:33.984402"], ["updated_at", "2016-05-03 09:34:33.984402"]]
---
      <span class="user_name"><%= commenter_link(comment.account) %></span>
      <span class="time"><%= time_ago_in_words(comment.created_at) %>前</span>