app/views/blog/_right.html.erb

SELECT  "blog_comments".* FROM "blog_comments"  ORDER BY id DESC LIMIT 5
---
<ul class="comment">
	<% BlogComment.order('id DESC').limit(5).each do |comment| %>